app/helpers/estados_helper.rb

  def options_estados(opts = { prioridade: true })
    return Estado.order(:uf).pluck(:descricao, :id)
---
SELECT "estados"."descricao", "estados"."uf" FROM "estados" ORDER BY "estados"."uf" ASC