app/controllers/cidades_controller.rb

  def index
    authorize Cidade
    @cidades = Cidade.includes(:estado).order(id: :desc).page(params[:page])
---
SELECT "cidades".* FROM "cidades" ORDER BY "cidades"."id" DESC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]

  def create
    authorize Cidade
    @cidade = Cidade.new(cidade_params)

    respond_to do |format|
      if @cidade.save
---
INSERT INTO "cidades" ("cod", "descricao", "estado_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cod", "1321"], ["descricao", "Fortaleza"], ["estado_id", 1], ["created_at", "2020-12-16 14:24:19.111931"], ["updated_at", "2020-12-16 14:24:19.111931"]]

  def update
    respond_to do |format|
      if @cidade.update(cidade_params)
---
UPDATE "cidades" SET "descricao" = $1, "updated_at" = $2 WHERE "cidades"."id" = $3  [["descricao", "FORTALEZA"], ["updated_at", "2020-12-11 17:52:53.847042"], ["id", 1]]

    def set_cidade
      @cidade = Cidade.find(params[:id])
---
SELECT "cidades".* FROM "cidades" WHERE "cidades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]