app/models/usuario.rb

  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:username)
      where(conditions.to_h).where(['lower(username) = :value', { value: login.downcase }]).first
    elsif !conditions.to_h.blank?
---
SELECT "usuarios".* FROM "usuarios" WHERE (lower(username) = 'admin') ORDER BY "usuarios"."id" ASC LIMIT $1  [["LIMIT", 1]]